backend/app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "trtr"], ["content", "trtr"], ["created_at", "2025-06-15 12:16:02.058078"], ["updated_at", "2025-06-15 12:16:02.058078"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save